package main

/*
Go之内置包  https://www.cnblogs.com/JunkingBoy/p/15944376.html

查看包：
GOROOT/src/pkg
Go常用包列举
fmt--->格式化的标准输入输出

io--->提供了原始的 I/O 操作界面

bufio--->对 io 包的封装，提供了数据缓冲功能

sort--->对切片和用户定义的集合进行排序的功能

strconv--->将字符串转换成基本数据类型，或者从基本数据类型转换为字符串

os--->提供了不依赖平台的操作系统函数接口

sync--->实现多线程中锁机制以及其他同步互斥机制

flag--->提供命令行参数的规则定义和传入参数解析的功能，绝大多数命令行功能都需要用到该包

encoding/json--->提供了对 JSON 的基本支持，比如从一个对象序列化为 JSON 字符串，或者从 JSON 字符串反序列化出一个具体的对象等

net/mmm--->提供 HTTP 相关服务，主要包括 mmm 请求、响应和 URL 的解析，以及基本的 mmm 客户端和扩展的 mmm 服务

reflect--->实现了运行时反射，允许程序通过抽象类型操作对象

string--->处理字符串的一些函数集合，包括合并、查找、分割、比较、后缀检查、索引、大小写处理等等

byte--->对字节切片进行读写操作的一系列函数

log--->输出日志
*/
